app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("message", "post_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "yo"], ["post_id", 9], ["created_at", 2016-10-27 10:28:12 UTC], ["updated_at", 2016-10-27 10:28:12 UTC], ["user_id", 2]]

  def destroy
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 25]]

  def set_comment
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]