app/controllers/posts_controller.rb

INSERT INTO "posts" ("line", "user_id", "description", "date", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = current_user.posts.new(post_params)

    if @post.save