app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "ken"], ["updated_at", 2016-10-25 10:29:08 UTC], ["id", 2]]